"""
Правильная, круглая, скобочная

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Если из правильного арифметического выражения вычеркнуть всё, кроме круглых
скобок, то получится правильная скобочная последовательность. Проверьте,
является ли введённая строка правильной скобочной последовательностью.


Формат ввода:
Вводится непустая строка, состоящая из открывающих и закрывающих круглых скобок.
Длина строки не превосходит 100_000.


Формат вывода:
Выведите YES если введённая строка является правильной скобочной
последовательностью и NO иначе.


Пример 1:
input:
(())()
output:
YES

Пример 2:
input:
(()))()
output:
NO
"""
import sys


def main(lines: list[str] | None = None) -> str:

    lines = lines or sys.stdin.read().splitlines()

    string = lines[0]

    count = 0
    for par in string:
        if par == "(":
            count += 1
        elif count > 0:
            count -= 1
        else:
            return "NO"

    return "YES" if count == 0 else "NO"


if __name__ == "__main__":
    result = main()
    print(result)
