"""
Параллелограмм

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

На уроке геометрии семиклассники Вася и Петя узнали, что такое параллелограмм.
На перемене после урока они стали играть в игру: Петя называл координаты четырёх
точек в произвольном порядке, а Вася должен был ответить, являются ли эти точки
вершинами параллелограмма.

Вася, если честно, не очень понял тему про параллелограммы, и ему требуется
программа, умеющая правильно отвечать на Петины вопросы.

Напомним, что параллелограммом называется четырёхугольник, противоположные
стороны которого равны и параллельны.


Формат ввода:
В первой строке входного файла записано целое число N (1 ≤ N ≤ 10) - количество
заданных Петей вопросов. Каждая из N последующих строк содержит описание четырёх
точек - четыре пары целых чисел X и Y (−100 ≤ X ≤ 100, −100 ≤ Y ≤ 100),
обозначающих координаты точки. Гарантируется, что четыре точки, о которых идёт
речь в одном вопросе, не лежат на одной прямой.


Формат вывода:
Для каждого из вопросов выведите "YES", если четыре заданные точки могут
образовать параллелограмм, и "NO" в противном случае. Ответ на каждый из
запросов должен быть в отдельной строке без кавычек.


Пример:
input:
3
1 1 4 2 3 0 2 3
1 1 5 2 2 3 3 0
0 0 5 1 6 3 1 2
output:
YES
NO
YES
"""
import sys
from itertools import permutations


def main(lines: list[str] | None = None) -> list[str]:

    lines = lines or sys.stdin.read().splitlines()

    n = int(lines[0])
    result = []
    for i in range(n):
        xa, ya, xb, yb, xc, yc, xd, yd = map(int, lines[i+1].split())
        points = [(xa, ya), (xb, yb), (xc, yc), (xd, yd)]
        answer = "NO"
        for p1, p2, p3, p4 in permutations(points):
            if p1[0] + p2[0] == p3[0] + p4[0] and p1[1] + p2[1] == p3[1] + p4[1]:
                answer = "YES"
                break
        result.append(answer)

    return result


if __name__ == "__main__":
    result = main()
    print("\n".join(result))
