"""
Количество равных максимальному

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Последовательность состоит из натуральных чисел и завершается числом 0. Всего
вводится не более 10_000 чисел (не считая завершающего числа 0). Определите,
сколько элементов этой последовательности равны её наибольшему элементу.

Числа, следующие за числом 0, считывать не нужно.


Формат ввода:
Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в
последовательность не входит).


Формат вывода:
Выведите ответ на задачу.


Пример 1:
input:
1
7
9
0
output:
1

Пример 2:
input:
1
3
3
1
0
output:
2
"""
import sys


def main(lines: list[str] | None = None) -> int:

    lines = lines or sys.stdin.read().splitlines()

    count = 0
    maximum = -1
    i = 0
    while True:
        num = int(lines[i])
        if num == 0:
            break
        if num > maximum:
            maximum = num
            count = 1
        elif num == maximum:
            count += 1
        i += 1

    return count


if __name__ == "__main__":
    result = main()
    print(result)
