"""
Дома и магазины

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

На Новом проспекте построили подряд 10 зданий. Каждое здание может быть либо
жилым домом, либо магазином, либо офисным зданием.

Но оказалось, что жителям некоторых домов на Новом проспекте слишком далеко
приходится идти до ближайшего магазина. Для разработки плана развития
общественного транспорта на Новом проспекте мэр города попросил вас выяснить,
какое же наибольшее расстояние приходится преодолевать жителям Нового проспекта,
чтобы дойти от своего дома до ближайшего магазина.


Формат ввода:
Программа получает на вход десять чисел, разделённых пробелами. Каждое число
задаёт тип здания на Новом проспекте: число 1 обозначает жилой дом, число 2
обозначает магазин, число 0 обозначает офисное здание. Гарантируется, что на
Новом проспекте есть хотя бы один жилой дом и хотя бы один магазин.


Формат вывода:
Выведите одно целое число: наибольшее расстояние от дома до ближайшего к нему
магазина. Расстояние между двумя соседними домами считается равным 1 (то есть
если два дома стоят рядом, то между ними расстояние 1, если между двумя домами
есть ещё один дом, то расстояние между ними равно 2 и т.д.)


Пример:
input:
2 0 1 1 0 1 0 2 1 2
output:
3
"""
import sys


def main(lines: list[str] | None = None) -> int:

    lines = lines or sys.stdin.read().splitlines()

    buildings = lines[0].split()
    n = len(buildings)

    # ищем левый магазин
    left_store = 0
    while left_store < n and buildings[left_store] != "2":
        left_store += 1

    # ищем правый магазин
    right_store = 0
    while right_store < n and buildings[right_store] != "2":
        right_store += 1

    # идём по домам
    max_dist = -1
    i = 0
    while i < n:
        if i == right_store:
            left_store = right_store
            right_store += 1
            while right_store < n and buildings[right_store] != "2":
                right_store += 1
            right_store = left_store if right_store == n else right_store
        elif buildings[i] == "1":
            dist = min(abs(left_store - i), abs(right_store - i))
            max_dist = max(max_dist, dist)
        i += 1

    return max_dist


if __name__ == "__main__":
    result = main()
    print(result)
