"""
Изготовление палиндромов

Ограничение времени - 2 секунды
Ограничение памяти - 512Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

В строкоремонтную мастерскую принесли строку, состоящую из строчных латинских
букв. Заказчик хочет сделать из неё палиндром. В мастерской могут за
1 байтландский тугрик заменить произвольную букву в строке любой выбранной
заказчиком буквой.

Какую минимальную сумму придётся заплатить заказчику за ремонт строки?

Напомним, что палиндромом называется строка, которая равна самой себе,
прочитанной в обратном направлении.


Формат ввода:
Входные данные содержат непустую строку, состоящую из строчных латинских букв,
которую принёс заказчик. Длина строки не превосходит 10^4.


Формат вывода:
Выведите одно целое число — минимальную сумму, которую заказчику придётся
заплатить за превращение принесённой заказчиком строки в палиндром.


Пример 1:
input:
a
output:
0

Пример 2:
input:
ab
output:
1

Пример 3:
input:
cognitive
output:
4
"""
import sys


def main(lines: list[str] | None = None) -> int:

    lines = lines or sys.stdin.read().splitlines()

    string = lines[0]

    n = len(string)
    left = 0
    right = n - 1
    count = 0
    while left < right:
        if string[left] != string[right]:
            count += 1
        left += 1
        right -= 1

    return count


if __name__ == "__main__":
    result = main()
    print(result)
