"""
Лавочки в атриуме

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

В атриуме нового корпуса ФНК урбанисты установили модные гранитные лавочки (на
которых холодно сидеть зимой и жарко летом). Лавочка устроена следующим образом:
несколько одинаковых кубических гранитных блоков ставятся в ряд, а на них
кладётся гранитная плита.

При этом блоки располагаются так, чтобы плита не падала: для этого достаточно,
чтобы и слева, и справа от центра плиты был хотя бы один гранитный блок или его
часть (в частности, если центр плиты приходится на середину какого-нибудь блока,
то и слева, и справа от центра плиты находится часть блока, и плита не падает).

На ФНК много первокурсников (но это только пока не произошли отчисления за
списывания на курсе ОиМП) и им не хватает стульев в аудиториях. Студенты
обнаружили, что блоки можно использовать в аудитории в качестве сиденья. Можно
по одному вытаскивать блоки, находящиеся с краю (как слева, так и справа). Они
хотят вытащить из-под лавочки как можно больше блоков так, чтобы она при этом не
упала (передвигать оставшиеся блоки нельзя). Определите, какие блоки они должны
оставить.


Формат ввода:
В первой строке входных данных содержатся два числа: L — длина лавочки и K —
количество гранитных блоков-ножек. Оба числа натуральные и не превышают 10 000.

Во второй строке следуют K различных целых неотрицательных чисел, задающих
положение каждой ножки. Положение ножки определяется расстоянием от левого края
плиты до левого края ножки (ножка — это куб размером 1×1×1). Ножки перечислены
слева направо (то есть начиная с ножки с меньшим расстоянием до левого края).


Формат вывода:
Требуется перечислить ножки, которые студентам нужно оставить. Для каждой ножки
нужно выдать её положение, как оно задано во входных данных. Ножки следует
перечислять слева направо, в том порядке, в котором они встречаются во входных
данных.


Пример 1:
input:
5 2
0 2
output:
2

Пример 2:
input:
13 4
1 4 8 11
output:
4 8

Пример 3:
input:
14 6
1 6 8 11 12 13
output:
6 8
"""
import sys


def main(lines: list[str] | None = None) -> list[int]:

    lines = lines or sys.stdin.read().splitlines()

    l, k = map(int, lines[0].split())
    blocks = list(map(int, lines[1].split()))

    lo = 0
    hi = k - 1
    while lo < hi:
        mid = (lo + hi) // 2
        if blocks[mid] >= l // 2:
            hi = mid
        else:
            lo = mid + 1
    right = blocks[lo]

    lo = 0
    hi = k - 1
    while lo < hi:
        mid = (lo + hi + 1) // 2
        if blocks[mid] <= (l - 1) // 2:
            lo = mid
        else:
            hi = mid - 1
    left = blocks[lo]

    if left == right:
        return [left]
    else:
        return [left, right]


if __name__ == "__main__":
    result = main()
    print(" ".join(map(str, result)))
