"""
Толя-Карп и новый набор структур, часть 2

Ограничение времени - 3 секунды
Ограничение памяти - 255Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Толя-Карп запросил для себя n посылок с «Аллигатор-экспресс».

Посылка представляет из себя ящик. Внутри ящика лежит целое число a_i. Номер на
ящике d_i указывает на цвет числа, лежащего внутри.

Толю-Карпа интересует, чему будут равны значения чисел, если сложить между собой
все те, что имеют одинаковый цвет. Напишите, пожалуйста, программу, которая
выводит результат.


Формат ввода:
В первой строке одно число n (0 ≤ n ≤ 2∗10^5).

В следующих n строках заданы по два числа: цвет числа в ящике d_i и значение
числа a_i (−10^18 ≤ d_i, a_i ≤ 10^18).

Гарантируется, что сумма чисел одного цвета не превышает 10^18.


Формат вывода:
Выведите в порядке возрастания номера цвета пары чисел, каждая в новой строке:
номер цвета и сумму всех чисел данного цвета.


Пример 1:
input:
7
1 5
10 -5
1 10
4 -2
4 3
4 1
4 0
output:
1 15
4 2
10 -5

Пример 2:
input:
5
5 -10000
-5 100000000000
10 2000000000000
-5 -300000000000
0 10000000000000
output:
-5 -200000000000
0 10000000000000
5 -10000
10 2000000000000
"""
import sys
from collections import defaultdict


def main(lines: list[str] | None = None) -> list[tuple[int, int]]:

    lines = lines or sys.stdin.read().splitlines()

    n = int(lines[0])
    counter = defaultdict(int)
    for i in range(n):
        d, a = map(int, lines[1+i].split())
        counter[d] += a

    return list(sorted(counter.items()))


if __name__ == "__main__":
    result = main()
    print("\n".join(f"{d} {a}" for d, a in result))
