"""
Выборы в США

Ограничение времени - 2 секунды
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Как известно, в США президент выбирается не прямым голосованием, а путём
двухуровневого голосования. Сначала проводятся выборы в каждом штате и
определяется победитель выборов в данном штате. Затем проводятся
государственные выборы: на этих выборах каждый штат имеет определённое число
голосов — число выборщиков от этого штата. На практике, все выборщики от штата
голосуют в соответствии с результатами голосования внутри штата, то есть на
заключительной стадии выборов в голосовании участвуют штаты, имеющие различное
число голосов. Вам известно за кого проголосовал каждый штат и сколько голосов
было отдано данным штатом. Подведите итоги выборов: для каждого из участника
голосования определите число отданных за него голосов.


Формат ввода:
Каждая строка входного файла содержит фамилию кандидата, за которого отдают
голоса выборщики этого штата, затем через пробел идёт количество выборщиков,
отдавших голоса за этого кандидата.


Формат вывода:
Выведите фамилии всех кандидатов в лексикографическом порядке, затем, через
пробел, количество отданных за них голосов.


Пример 1:
input:
McCain 10
McCain 5
Obama 9
Obama 8
McCain 1
output:
McCain 16
Obama 17

Пример 2:
input:
ivanov 100
ivanov 500
ivanov 300
petr 70
tourist 1
tourist 2
output:
ivanov 900
petr 70
tourist 3

Пример 3:
input:
bur 1
output:
bur 1
"""
import sys
from collections import defaultdict


def main(lines: list[str] | None = None) -> list[tuple[str, int]]:

    lines = lines or sys.stdin.read().splitlines()

    counter = defaultdict(int)
    for line in lines:
        surname, count = line.split()
        counter[surname] += int(count)

    return list(sorted(counter.items()))


if __name__ == "__main__":
    result = main()
    print("\n".join(f"{surname} {count}" for surname, count in result))
