"""
Форум

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Клуб Юных Хакеров организовал на своём сайте форум. Форум имеет следующую
структуру: каждое сообщение либо начинает новую тему, либо является ответом на
какое-либо предыдущее сообщение и принадлежит той же теме.

После нескольких месяцев использования своего форума юных хакеров заинтересовал
вопрос - какая тема на их форуме наиболее популярна. Помогите им выяснить это.


Формат ввода:
В первой строке вводится целое число N - количество сообщений в форуме
(1 <= N <= 1000). Следующие строки содержат описание сообщений в хронологическом
порядке.

Описание сообщения, которое представляет собой начало новой темы, состоит из
трёх строк. Первая строка содержит число 0. Вторая строка содержит название
темы. Длина названия не превышает 30 символов. Третья строка содержит текст
сообщения.

Описание сообщения, которое является ответом на другое сообщение, состоит из
двух строк. Первая строка содержит целое число - номер сообщения, ответом на
которое оно является. Сообщения нумеруются, начиная с единицы. Ответ всегда
появляется позже, чем сообщение, ответом на которое он является. Вторая строка
содержит текст сообщения.

Длина каждого из сообщений не превышает 100 символов.


Формат вывода:
Выведите название темы, к которой относится наибольшее количество сообщений.
Если таких тем несколько, то выведите первую в хронологическом порядке.


Пример 1:
input:
7
0
Олимпиада по информатике
Скоро третья командная олимпиада?
0
Новая компьютерная игра
Вышла новая крутая игра!
1
Она пройдет 24 ноября
1
В Санкт-Петербурге и Барнауле
2
Где найти?
4
Примет участие более 50 команд
6
Интересно, какие будут задачи
output:
Олимпиада по информатике

Пример 2:
input:
1
0
topic 1
body 1
output:
topic 1
"""
import sys


def main(lines: list[str] | None = None) -> str:

    lines = lines or sys.stdin.read().splitlines()

    n = int(lines[0])
    counter = dict()
    messages = []
    i = 1
    for _ in range(n):
        num = int(lines[i])
        i += 1

        if num == 0:
            topic = lines[i]
            i += 1

            message = lines[i]
            i += 1

            counter[topic] = 1
            messages.append(topic)

        else:
            message = lines[i]
            i += 1

            topic = messages[num-1]

            counter[topic] += 1
            messages.append(topic)

    max_count = 0
    populest_topic = ""
    for topic, count in counter.items():
        if count > max_count:
            max_count = count
            populest_topic = topic

    return populest_topic


if __name__ == "__main__":
    result = main()
    print(result)
