"""
Даты

Ограничение времени - 2 секунды
Ограничение памяти - 512Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Как известно, два наиболее распространённых формата записи даты — это
европейский (сначала день, потом месяц, потом год) и американски (сначала месяц,
потом день, потом год). Системный администратор поменял дату на одном из бэкапов
и сейчас хочет вернуть дату обратно. Но он не проверил, в каком формате дата
используется в системе. Может ли он обойтись без этой информации?

Иначе говоря, вам даётся запись некоторой корректной даты. Требуется выяснить,
однозначно ли по этой записи определяется дата даже без дополнительной
информации о формате.


Формат ввода:
Первая строка входных данных содержит три целых числа — x, y и z (1 ≤ x ≤ 31,
1 ≤ y ≤ 31, 1970 ≤ z ≤ 2069). Гарантируется, что хотя бы в одном формате запись
x y z задаёт корректную дату.


Формат вывода:
Выведите 1, если дата определяется однозначно, и 0 в противном случае.


Пример 1
input: 1 2 2003
output: 0

Пример 2
input: 2 29 2008
output: 1


Примечания:
В первом примере при одной системе записи дата равна 1 февраля, при другой -
2 января 2003 года, то есть однозначно назвать дату не получается.

Во втором примере корректный вариант даты может быть только в американском
формате, где она задаёт 29 февраля 2008 года.
"""
import sys
from dataclasses import dataclass
from typing import Self


@dataclass
class ProblemInput:
    x: int
    y: int
    z: int


class Solver:
    def __init__(self, data: ProblemInput) -> None:
        self.data = data

    @classmethod
    def from_stdin(cls) -> Self:
        x, y, z = map(int, sys.stdin.readline().strip().split())
        return cls(ProblemInput(x, y, z))

    @classmethod
    def from_strings(cls, lines: list[str]) -> Self:
        x, y, z = map(int, lines[0].split())
        return cls(ProblemInput(x, y, z))

    def solve(self) -> int:

        x = self.data.x
        y = self.data.y

        if x == y:
            return 1
        elif x > 12 or y > 12:
            return 1
        else:
            return 0


def main() -> None:

    solver = Solver.from_stdin()
    result = solver.solve()

    print(result)


if __name__ == "__main__":
    main()
