"""
Забавный конфуз

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Пусть A — массив, состоящий из N элементов A_1, …, A_N. Обозначим его
максимальное и минимальное значение через max(A) и min(A) соответственно.
Вычислим сумму элементов S, S = A_1 + A_2 + … + A_N. Заменим каждый элемент
массива на разницу S и этого элемента:
A_i := S − A_i, 1 ⩽ i ⩽ N.

Такое преобразование массива A назовём операцией Confuse. Напишите программу,
которая по массиву B, полученному в результате K-кратного применения операции
Confuse к некоторому массиву A, вычислит разность max(A) - min(A).


Формат ввода:
Первая строка входного файла содержит целые числа N и K, где N — количество
элементов массива B (2 ⩽ N ⩽ 10_000), а K — количество применений операции
Confuse к начальному массиву A, 1 ⩽ K ⩽ 100. Вторая строка файла содержит N
элементов массива B. Элементы массива B — целые числа, принадлежащие диапазону
от −2_000_000_000 до 2_000_000_000.


Формат вывода:
Единственная строка выходного файла должна содержать целое число - разность
max(A) и min(A).


Пример:
input:
4 2
45 52 47 46
output:
7
"""
import sys


def main(lines: list[str] | None = None) -> int:

    lines = lines or sys.stdin.read().splitlines()

    n, k = map(int, lines[0].split())
    nums = list(map(int, lines[1].split()))

    return max(nums) - min(nums)


if __name__ == "__main__":
    result = main()
    print(result)
