"""
Изобретательный Петя

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Петя нашёл на чердаке старый телеграфный аппарат и приделал к нему хитроумное
устройство, которое может печатать на телеграфной ленте определённое слово
(обозначим его X). Петино устройство может напечатать на ленте это слово сколько
угодно раз. Петя может заставить аппарат напечатать на ленте и любое другое
сообщение, но для этого ему нужно разобрать своё хитроумное устройство, и после
этого он уже не сможет печатать сообщение X. А самое главное, что напечатать
даже один символ другого сообщения потребует от Пети больше усилий, чем
напечатать на ленте слово X с помощью хитроумного устройства.

Петя хочет сделать так, чтобы всем казалось, что ему по телеграфу пришло
сообщение Z. Для этого он может (строго в этой последовательности):
- сколько угодно раз напечатать сообщение X
- разобрать хитроумное устройство и посимвольно напечатать ещё что-нибудь
  (назовём это Y)
- оторвать и выбросить начало ленты так, чтобы на оставшейся ленте было
  напечатано в точности сообщение Z

Поскольку набирать отдельные символы сообщения Y довольно сложно, Петя хочет,
чтобы в сообщении Y было как можно меньше символов.

Для лучшего понимания задачи смотрите примеры и пояснения к ним.


Формат ввода:
В первой строке вводится слово X, которое Петя может печатать с помощью
хитроумного устройства сколько угодно раз. Во второй строке вводится сообщение Z,
которое хочет получить Петя. Каждое сообщение состоит только из маленьких
латинских букв и имеет длину не более 100 символов.


Формат вывода:
Выведите минимальное по длине сообщение Y, которое Пете придётся допечатать
вручную.


Пример 1:
input:
mama
amamam
output:
m

Пример 2:
input:
ura
mura
output:
mura

Пример 3:
input:
computer
comp
output:
comp

Пример 4:
input:
ejudge
judge
output:


Пример 5:
input:
m
mmm
output:



Примечания:
1. Сначала Петя два раза напечатает слово mama, потом к нему припечатает букву m,
   а затем отрежет и выбросит три начальных символа (mam). Ответом является
   допечатываемая отдельно буква m.
2. Казалось бы, Пете стоит сначала напечатать букву m, а затем слово ura,
   которое он умеет печатать. Однако для того, чтобы напечатать m, ему придётся
   разобрать свое устройство, и печатать ura ему придётся также посимвольно.
3. Казалось бы, Петя может напечатать слово computer, а затем отрезать и
   выбросить его конец — однако он не может так поступить, потому что отрезать и
   выбросить он может только начало ленты.
4. Пете достаточно один раз напечатать слово ejudge, а затем отрезать и
   выбросить букву e. Ничего посимвольно выводить ему не придётся, поэтому
   ответом является пустая строка.
5. Достаточно трижды напечатать исходное слово и нужный результат будет получен.
   Ничего добавлять не надо, поэтому ответ – пустая строка.
"""
import sys


def main(lines: list[str] | None = None) -> str:

    lines = lines or sys.stdin.read().splitlines()

    x = lines[0]
    z = lines[1]

    i = z.find(x)
    # слова x нет целиком в z
    if i == -1:
        # 1) есть хвост x в начале z
        for j in range(1, len(x)):
            if z.find(x[j:]) == 0:
                return z[len(x) - j:]
        # 2) необходимо z печатать целиком
        else:
            return z
    else:
        # z должен начинаться с хвоста x
        if len(x) <= i:
            return z

        if x[len(x)-i:] != z[:i]:
            return z

        ptr_z = i
        while ptr_z + len(x) <= len(z) and z[ptr_z:ptr_z + len(x)] == x:
            ptr_z += len(x)

        return z[ptr_z:]


if __name__ == "__main__":
    result = main()
    print(result)
