"""
Шахматная доска

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Из шахматной доски по границам клеток выпилили связную (не распадающуюся на
части) фигуру без дыр. Требуется определить её периметр.


Формат ввода:
Сначала вводится число N (1 ≤ N ≤ 64) – количество выпиленных клеток.
В следующих N строках вводятся координаты выпиленных клеток, разделённые
пробелом (номер строки и столбца – числа от 1 до 8). Каждая выпиленная клетка
указывается один раз.


Формат вывода:
Выведите одно число – периметр выпиленной фигуры (сторона клетки равна единице).


Пример 1:
input:
3
1 1
1 2
2 1
output:
8

Пример 2:
input:
1
8 8
output:
4


Примечания:
1) Вырезан уголок из трёх клеток. Сумма длин его сторон равна 8.
2) Вырезана одна клетка. Её периметр равен 4.
"""
import sys


def main(lines: list[str] | None = None) -> int:

    lines = lines or sys.stdin.read().splitlines()

    n = int(lines[0])
    perimeter = 0
    seen = set()
    for i in range(n):
        x, y = map(int, lines[i+1].split())
        adder = 4
        for dx, dy in [(-1, 0), (1, 0), (0, -1), (0, 1)]:
            if ((x + dx), (y + dy)) in seen:
                adder -= 2
        perimeter += adder
        seen.add((x, y))

    return perimeter


if __name__ == "__main__":
    result = main()
    print(result)
