"""
Петя, Маша и верёвочки

Ограничение времени - 1 секунда
Ограничение памяти - 512Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

На столе лежали две одинаковые верёвочки целой положительной длины.

Петя разрезал одну из верёвочек на N частей, каждая из которых имеет целую
положительную длину, так что на столе стало N+1 верёвочек. Затем в комнату зашла
Маша и взяла одну из лежащих на столе верёвочек. По длинам оставшихся на столе N
верёвочек определите, какую наименьшую длину может иметь верёвочка, взятая Машей.


Формат ввода:
Первая строка входных данных содержит одно целое число N — количество верёвочек,
оставшихся на столе (2 ≤ N ≤ 1000). Во второй строке содержится N целых чисел
l_i — длины верёвочек (1 ≤ l_i ≤ 1000).


Формат вывода:
Выведите одно целое число — наименьшую длину, которую может иметь верёвочка,
взятая Машей.


Пример 1:
input:
4
1 5 2 1
output:
1

Пример 2:
input:
4
5 12 4 3
output:
24
"""
import sys


def main(lines: list[str] | None = None) -> int:

    lines = lines or sys.stdin.read().splitlines()

    n = int(lines[0])
    ropes = list(map(int, lines[1].split()))

    sum_ = sum(ropes)
    max_ = max(ropes)
    len1 = max_ - (sum_ - max_)  # взяла один из обрезков
    len2 = sum_  # взяла исходную верёвочку

    return len1 if len1 > 0 else len2


if __name__ == "__main__":
    result = main()
    print(result)
