"""
Газон

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Фермер Иван с юности следит за своим газоном. Газон можно считать плоскостью, на
которой в каждой точке с целыми координатами растёт один пучок травы.

В одно из воскресений Иван воспользовался газонокосилкой и постриг некоторый
прямоугольный участок газона. Стороны этого участка параллельны осям координат,
а две противоположные вершины расположены в точках (x_1, y_1) и (x_2, y_2).
Следует отметить, что пучки травы, находящиеся на границе этого прямоугольника,
также были пострижены.

Довольный результатом Иван купил и установил на газоне дождевальную установку.
Она была размещена в точке с координатами (x_3, y_3) и имела радиус действия
струи r. Таким образом, установка начала поливать все пучки, расстояние от
которых до точки (x_3, y_3) не превышало r.

Все было хорошо, но Ивана заинтересовал следующий вопрос: сколько пучков травы
оказалось и пострижено, и полито в это воскресенье?

Требуется написать программу, которая позволит дать ответ на вопрос Ивана.


Формат ввода:
В первой строке входного файла содержатся четыре целых числа x_1, y_1, x_2, y_2
(−100_000 ≤ x_1 < x_2 ≤ 100_000; −100_000 ≤ y_1 < y_2 ≤ 100_000).

Во второй строке входного файла содержатся три целых числа x_3, y_3, r
(−100_000 ≤ x_3, y_3 ≤ 100_000; 1 ≤ r ≤ 100_000).


Формат вывода:
В выходной файл необходимо вывести одно целое число — число пучков травы,
которые были и пострижены, и политы.


Пример 1:
input:
0 0 5 4
4 0 3
output:
14
"""
import sys
from math import isqrt


def main(lines: list[str] | None = None) -> int:

    lines = lines or sys.stdin.read().splitlines()

    x1, y1, x2, y2 = map(int, lines[0].split())
    x3, y3, r = map(int, lines[1].split())

    left_x = max(x1, x3 - r)
    right_x = min(x2, x3 + r)
    bottom_y = max(y1, y3 - r)
    top_y = min(y2, y3 + r)

    count = 0
    if left_x > right_x or bottom_y > top_y:
        return count

    r_sq = r * r
    for x in range(left_x, right_x+1):
        cathet_a = x - x3
        cathet_b = isqrt(r_sq - cathet_a * cathet_a)
        y_lo = max(bottom_y, y3 - cathet_b)
        y_hi = min(top_y, y3 + cathet_b)
        if y_lo <= y_hi:
            count += y_hi - y_lo + 1

    return count


if __name__ == "__main__":
    result = main()
    print(result)
