"""
Количество совпадающих

Ограничение времени - 3 секунды
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Даны два списка чисел, которые могут содержать до 100_000 чисел каждый.
Посчитайте, сколько чисел содержится одновременно как в первом списке, так и во
втором. Примечание. Эту задачу на Питоне можно решить в одну строчку.


Формат ввода:
Вводятся два списка чисел. Все числа каждого списка находятся на отдельной
строке.


Формат вывода:
Выведите ответ на задачу.


Пример 1:
input:
1 3 2
4 3 2
output:
2

Пример 2:
input:
1 2 6 4 5 7
10 2 3 4 8
output:
2

Пример 3:
input:
1 7 3 8 10 2 5
6 5 2 8 4 3 7
output:
5
"""
import sys


def main(lines: list[str] | None = None) -> int:

    lines = lines or sys.stdin.read().splitlines()

    nums1 = list(map(int, lines[0].split()))
    nums2 = list(map(int, lines[1].split()))

    return len(set(nums1) & set(nums2))


if __name__ == "__main__":
    result = main()
    print(result)
