"""
Угадай число

Ограничение времени - 6 секунд
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Август и Беатриса играют в игру. Август загадал натуральное число от 1 до n.
Беатриса пытается угадать это число, для этого она называет некоторые множества
натуральных чисел. Август отвечает Беатрисе YES, если среди названых ей чисел
есть задуманное или NO в противном случае. После нескольких заданных вопросов
Беатриса запуталась в том, какие вопросы она задавала и какие ответы получила и
просит вас помочь ей определить, какие числа мог задумать Август.


Формат ввода:
Первая строка входных данных содержит число n — наибольшее число, которое мог
загадать Август. Далее идут строки, содержащие вопросы Беатрисы. Каждая строка
представляет собой набор чисел, разделённых пробелами. После каждой строки с
вопросом идёт ответ Августа: YES или NO. Наконец, последняя строка входных
данных содержит одно слово HELP.


Формат вывода:
Вы должны вывести (через пробел, в порядке возрастания) все числа, которые мог
задумать Август.


Пример 1:
input:
10
1 2 3 4 5
YES
2 4 6 8 10
NO
HELP
output:
1 3 5

Пример 2:
input:
10
1 2 3 4 5 6 7 8 9 10
YES
1
NO
2
NO
3
NO
4
NO
6
NO
7
NO
8
NO
9
NO
10
NO
HELP
output:
5
"""
import sys


def main(lines: list[str] | None = None) -> list[int]:

    lines = lines or sys.stdin.read().splitlines()

    n = int(lines[0])
    result = set(range(1, n+1))

    i = 1
    while lines[i] != "HELP":
        question = set(map(int, lines[i].split()))
        answer = lines[i+1]
        if answer == "YES":
            result &= question
        else:
            result -= question
        i += 2

    return list(sorted(result))


if __name__ == "__main__":
    result = main()
    print(" ".join(map(str, result)))
