"""
Точка и треугольник

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

На координатной плоскости расположены равнобедренный прямоугольный треугольник
ABC с длиной катета d и точка X. Катеты треугольника лежат на осях координат, а
вершины расположены в точках: A (0,0), B (d,0), C (0,d).

Напишите программу, которая определяет взаимное расположение точки X и
треугольника. Если точка X расположена внутри или на сторонах треугольника,
выведите 0. Если же точка находится вне треугольника, выведите номер ближайшей к
ней вершины.


Формат ввода:
Сначала вводится натуральное число d (не превосходящее 1000), а затем координаты
точки X – два целых числа из диапазона от –1000 до 1000.


Формат вывода:
Если точка лежит внутри, на стороне треугольника или совпадает с одной из
вершин, то выведите число 0. Если точка лежит вне треугольника, то выведите
номер вершины треугольника, к которой она расположена ближе всего (1 – к вершине
A, 2 – к B, 3 – к C). Если точка расположена на одинаковом расстоянии от двух
вершин, выведите ту вершину, номер которой меньше.


Пример 1:
input:
5
1 1
output:
0

Пример 2:
input:
3
-1 -1
output:
1

Пример 3:
input:
4
4 4
output:
2

Пример 4:
input:
4
2 2
output:
0
"""
import sys


def main(lines: list[str] | None = None) -> int:

    lines = lines or sys.stdin.read().splitlines()

    d = int(lines[0])
    x, y = map(int, lines[1].split())

    if 0 <= x <= d and 0 <= y <= d and x + y <= d:
        return 0

    min_dist = 1001 * 1001
    closest_vertex = -1
    vertexes = ((0, 0), (d, 0), (0, d))
    for i, (xt, yt) in enumerate(vertexes, 1):
        curr_dist = (x - xt) * (x - xt) + (y - yt) * (y - yt)
        if curr_dist < min_dist:
            min_dist = curr_dist
            closest_vertex = i

    return closest_vertex


if __name__ == "__main__":
    result = main()
    print(result)
