"""
Драгоценные камни

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

В одной далёкой восточной стране до сих пор по пустыням ходят караваны верблюдов,
с помощью которых купцы перевозят пряности, драгоценности и дорогие ткани.
Разумеется, основная цель купцов состоит в том, чтобы подороже продать имеющийся
у них товар. Недавно один из караванов прибыл во дворец одного могущественного
шаха.

Купцы хотят продать шаху n драгоценных камней, которые они привезли с собой. Для
этого они выкладывают их перед шахом в ряд, после чего шах оценивает эти камни и
принимает решение о том, купит он их или нет. Видов драгоценных камней на
Востоке известно не очень много всего 26, поэтому мы будем обозначать виды
камней с помощью строчных букв латинского алфавита. Шах обычно оценивает камни
следующим образом. Он заранее определил несколько упорядоченных пар типов камней:
(a_1, b_1), (a_2, b_2), ..., (a_k, b_k). Эти пары он называет красивыми, их
множество мы обозначим как P. Теперь представим ряд камней, которые продают
купцы, в виде строки S длины n из строчных букв латинского алфавита. Шах считает
число таких пар (i, j), что 1 ≤ i < j ≤ n, а камни S_i и S_j образуют красивую
пару, то есть существует такое число 1 ≤ q ≤ k, что S_i = a_q и S_j = b_q.

Если число таких пар оказывается достаточно большим, то шах покупает все камни.
Однако в этот раз купцы привезли настолько много камней, что шах не может
посчитать это число. Поэтому он вызвал своего визиря и поручил ему этот подсчёт.
Напишите программу, которая находит ответ на эту задачу.


Формат ввода:
Первая строка входного файла содержит целые числа n и k (1 ≤ n ≤ 100_000,
1 ≤ k ≤ 676) число камней, которые привезли купцы и число пар, которые шах
считает красивыми. Вторая строка входного файла содержит строку S, описывающую
типы камней, которые привезли купцы.

Далее следуют k строк, каждая из которых содержит две строчных буквы латинского
алфавита и описывает одну из красивых пар камней.


Формат вывода:
В выходной файл выведите ответ на задачу — количество пар, которое должен найти
визирь.


Пример 1:
input:
7 1
abacaba
aa
output:
6

Пример 2:
input:
7 3
abacaba
ab
ac
bb
output:
7
"""
import sys
from collections import defaultdict


def main(lines: list[str] | None = None) -> int:

    lines = lines or sys.stdin.read().splitlines()

    n, k = map(int, lines[0].split())

    positions = defaultdict(list)
    s = lines[1]
    for i, char in enumerate(s):
        positions[char].append(i)

    beautiful = defaultdict(list)
    for i in range(k):
        a, b = lines[2+i]
        beautiful[b].append(a)

    counter = defaultdict(int)
    total = 0
    for b in s:
        for a in beautiful[b]:
            total += counter[a]
        counter[b] += 1

    return total


if __name__ == "__main__":
    result = main()
    print(result)
