"""
Числа

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Саша и Катя учатся в начальной школе. Для изучения арифметики при этом
используются карточки, на которых написаны цифры (на каждой карточке написана
ровно одна цифра). Однажды они пришли на урок математики, и Саша, используя все
свои карточки, показал число A, а Катя показала число B. Учитель тогда захотел
дать им такую задачу, чтобы ответ на неё смогли показать и Саша, и Катя, каждый
используя только свои карточки. При этом учитель хочет, чтобы искомое число было
максимально возможным.


Формат ввода:
Во входном файле записано два целых неотрицательных числа A и B (каждое число в
одной строке). Длина каждого из чисел не превосходит 100_000 цифр.


Формат вывода:
Выведите одно число — максимальное целое число, которое можно составить
используя как цифры первого числа, так и цифры второго числа. Если же ни одного
такого числа составить нельзя, выведите -1.


Пример 1:
input:
280138
798081
output:
8810

Пример 2:
input:
123
456
output:
-1
"""
import sys
from collections import Counter


def main(lines: list[str] | None = None) -> str:

    lines = lines or sys.stdin.read().splitlines()

    a = lines[0].strip()
    b = lines[1].strip()

    counter_a = Counter(a)
    counter_b = Counter(b)

    res = []
    for digit in range(9, 0, -1):
        digit_str = str(digit)
        count_a = counter_a.get(digit_str, 0)
        count_b = counter_b.get(digit_str, 0)
        res.extend([digit_str] * min(count_a, count_b))

    count_a = counter_a.get("0", 0)
    count_b = counter_b.get("0", 0)
    if res:
        res.extend(["0"] * min(count_a, count_b))
    else:
        res.extend(["0"] * min(count_a, count_b, 1))

    res = "".join(res)

    return res or "-1"


if __name__ == "__main__":
    result = main()
    print(result)
