"""
Имена

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

На далекой планете Тау Кита есть непонятные нам обычаи. Например, таукитяне
очень необычно для землян выбирают имена своим детям. Родители так выбирают имя
ребёнку, чтобы оно могло быть получено как удалением некоторого набора букв из
имени отца, так и удалением некоторого набора букв из имени матери. Например,
если отца зовут «abacaba», а мать — «bbccaa», то их ребёнок может носить имена
«a», «bba», «bcaa», но не может носить имена «aaa», «ab» или «bbc». Возможно,
что имя ребёнка совпадает с именем отца и/или матери, если оно может быть
получено из имени другого родителя удалением нескольких (возможно, ни одной)
букв.

Пусть отец по имени X и мать по имени Y выбирают имя своему новорожденному
ребёнку. Так как в таукитянских школах учеников часто вызывают к доске в
лексикографическом порядке имён учеников, то есть в порядке следования имён в
словаре, то они хотят выбрать своему ребёнку такое имя, чтобы оно
лексикографически следовало как можно позже.

Формально, строка S лексикографически больше строки T, если выполняется одно из
двух условий: строка T получается из S удалением одной или более букв с конца
строки S; первые (i - 1) символов строк T и S не различаются, а буква в i-й
позиции строки T следует в алфавите раньше буквы в i-й позиции строки S.
Требуется написать программу, которая по именам отца и матери находит
лексикографически наибольшее имя для их ребёнка.


Формат ввода:
Первая строка входного файла содержит X — имя отца. Вторая строка входного файла
содержит Y — имя матери. Каждое имя состоит из строчных букв латинского алфавита,
включает хотя бы одну букву и имеет длину не более 10^5 букв.


Формат вывода:
Выходной файл должен содержать искомое лексикографически наибольшее из возможных
имён ребёнка. В случае, если подходящего имени для ребёнка не существует,
выходной файл должен быть пустым.


Пример 1:
input:
abcabca
abcda
output:
ca

Пример 2:
input:
ccba
accbbaa
output:
ccba
"""
import sys
from collections import Counter


def main(lines: list[str] | None = None) -> str:

    lines = lines or sys.stdin.read().splitlines()

    x = lines[0]
    y = lines[1]

    counter_x = Counter(x)
    counter_y = Counter(y)

    res = []
    ord_a = ord("a")
    ptr_x = 0
    ptr_y = 0
    for num in range(26, -1, -1):
        char = chr(ord_a + num)
        count_x = counter_x.get(char, 0)
        count_y = counter_y.get(char, 0)
        n = min(count_x, count_y)
        while n and ptr_x < len(x) and ptr_y < len(y):
            idx_x = x.find(char, ptr_x)
            idx_y = y.find(char, ptr_y)
            if idx_x != -1 and idx_y != -1:
                res.append(char)
                n -= 1
                ptr_x = idx_x + 1
                ptr_y = idx_y + 1
            else:
                n = 0

    return "".join(res)


if __name__ == "__main__":
    result = main()
    print(result)
