"""
Сложите конфетки

Ограничение времени - 2 секунды
Ограничение памяти - 512Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Васю угостили конфетами, а он решил частью конфет поделиться со своим младшим
братом Петей. Однако он хочет разделить конфеты не поровну, а по-братски.

Для этого Вася решил сыграть сам с собой в следующую игру. Он разложил конфеты
на столе в несколько кучек, которые расположил в ряд. Если кучек не меньше двух,
то из первой и последней в этом ряду кучек он выбирает ту, в которой меньше
конфет. Пусть в наименьшей кучке оказалось B конфет. Тогда он B конфет
перекладывает из первой кучки во вторую, и также B конфет перекладывает из
последней кучки в предпоследнюю. При этом, естественно, одна из кучек (или даже
две, если в первой и последней кучках конфет было поровну) становится пустой, и
Вася забывает про её существование. Он повторяет эти операции до тех пор, пока
на столе не останется одна или две кучки.

Если останется одна кучка, то Вася все конфеты съест сам, а если две — то
конфеты из первой кучки он съест сам, а из второй кучки отдаст Пете.

Напишите программу, которая по исходному распределению конфет в кучках определит,
чем закончится Васина игра.


Формат ввода:
Начальное расположение кучек конфет будет описываться K парами чисел A_i, N_i,
которые обозначают, что на столе выложено подряд N_i кучек конфет, по A_i конфет
в каждой.

Во входном файле задано сначала число K (1 ≤ K ≤ 10^5). Затем идёт K пар чисел
A_i, N_i (1 ≤ A_i ≤ 100, 1 ≤ N_i ≤ 10^8). Общее количество кучек так же не
превысит 10^8.


Формат вывода:
В выходной файл выведите сначала 1 или 2 — количество кучек конфет, которые
останутся в конце игры. Затем выведите соответственно одно или два числа —
количества конфет в оставшихся кучках.


Пример 1:
input:
3
2 2
3 2
2 1
output:
2
11 1

Пример 2:
input:
1
1 7
output:
1
7

Пример 3:
input:
5
1 1
2 1
3 1
4 1
5 2
output:
2
15 5


Примечания:
1. Исходно конфеты расположены в следующих кучках: 2 кучки по 2 конфеты, две
кучки из 3-х конфет и одна из 2-х:
2 2 3 3 2
Далее по 2 конфеты перекладывается из 1 и 5 кучек во 2 и 4, при этом и 1 и 5
кучки становятся пустыми, т.е. на столе остаётся только 3 кучки:
4 3 5
Теперь по 4 конфеты перекладываются из 1 и 3 кучек во 2-ю и на столе остаётся
две кучки, игра заканчивается с результатом 11 1

2. Изначально у нас 7 кучек по 1 конфете в каждой. После первого перекладывания
получится следующая конфигурация:
2 1 1 1 1 2
После второго:
3 1 3
После третьего останется одна кучка с 7 конфетами.

3. Изначально имеется 6 кучек:
1 2 3 4 5 5
После первого перекладывания получим:
3 3 4 6 4
После второго:
6 4 9 1
После третьего:
5 5 10
Наконец, получим:
15 5
"""
import sys


def main(lines: list[str] | None = None) -> list[int]:

    lines = lines or sys.stdin.read().splitlines()

    k = int(lines[0])
    piles = []
    for i in range(k):
        a, n = map(int, lines[1+i].split())
        piles.append([a, n])

        if k == 1 and n == 1:
            return [a]

    left = 0
    right = k - 1

    # Инициализация A (самая левая) и B (вторая слева)
    A = piles[left][0]
    piles[left][1] -= 1
    B = 0
    if piles[left][1] > 0:
        B = A
        piles[left][1] -= 1
    else:
        if left < right:
            left += 1
            B = piles[left][0]
            piles[left][1] -= 1
        else:
            B = A
            A = 0

    if piles[left][1] == 0 and left < right:
        left += 1

    # Инициализация D (самая правая) и C (предпоследняя)
    D = piles[right][0]
    piles[right][1] -= 1
    C = 0
    if piles[right][1] > 0:
        C = D
        piles[right][1] -= 1
    else:
        if left < right:
            right -= 1
            C = piles[right][0]
            piles[right][1] -= 1
        else:
            C = D
            D = 0

    if piles[right][1] == 0 and left < right:
        right -= 1

    while True:
        if A != 0 and B != 0 and C != 0 and D != 0:
            count = A if A < D else D
            A -= count
            B += count
            C += count
            D -= count
            if A == 0:
                if piles[left][1] > 0:
                    piles[left][1] -= 1
                    A = B
                    B = piles[left][0]
                    if piles[left][1] == 0 and left < right:
                        left += 1
                else:
                    if left < right:
                        left += 1
                        piles[left][1] -= 1
                        A = B
                        B = piles[left][0]
                        if piles[left][1] == 0 and left < right:
                            left += 1
            if D == 0:
                if piles[right][1] > 0:
                    piles[right][1] -= 1
                    D = C
                    C = piles[right][0]
                    if piles[right][1] == 0 and left < right:
                        right -= 1
                else:
                    if left < right:
                        right -= 1
                        piles[right][1] -= 1
                        D = C
                        C = piles[right][0]
                        if piles[right][1] == 0 and left < right:
                            right -= 1
        elif A == 0 and D == 0:
            return [B, C]
        elif A == 0:
            count = B if B < D else D
            B -= count
            C += count * 2
            D -= count
            if B == 0 and D == 0:
                return [C]
            if B == 0:
                return [C, D]
            else:
                return [B, C]
        elif D == 0:
            count = A if A < C else C
            A -= count
            B += count * 2
            C -= count
            if A == 0 and C == 0:
                return [B]
            if A == 0:
                return [B, C]
            else:
                return [A, B]
        elif B == 0:
            return [C]
        elif C == 0:
            return [B]


if __name__ == "__main__":
    result = main()
    print(len(result))
    print(*result)
