"""
Угадай число - 2

Ограничение времени - 1 секунда
Ограничение памяти - 256Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Август загадал натуральное число от 1 до n. Беатриса пытается угадать это число,
для этого она называет некоторые множества натуральных чисел. Август отвечает
Беатрисе YES, если среди названых ей чисел есть задуманное или NO в противном
случае. После нескольких заданных вопросов Беатриса запуталась в том, какие
вопросы она задавала и какие ответы получила и просит вас помочь ей определить,
какие числа мог задумать Август.

Август и Беатриса продолжают играть в игру, но Август начал жульничать. На
каждый из вопросов Беатрисы он выбирает такой вариант ответа YES или NO, чтобы
множество возможных задуманных чисел оставалось как можно больше. Например, если
Август задумал число от 1 до 5, а Беатриса спросила про числа 1 и 2, то Август
ответит NO, а если Беатриса спросит про 1, 2, 3, то Август ответит YES. Если же
Беатриса в своём вопросе перечисляет ровно половину из задуманных чисел, то
Август из вредности всегда отвечает NO. Наконец, Август при ответе учитывает все
предыдущие вопросы Беатрисы и свои ответы на них, то есть множество возможных
задуманных чисел уменьшается.


Формат ввода:
Вам дана последовательность вопросов Беатрисы. Приведите ответы Августа на них.
Первая строка входных данных содержит число n — наибольшее число, которое мог
загадать Август. Далее идут строки, содержащие вопросы Беатрисы. Каждая строка
представляет собой набор чисел, разделённых пробелами. Последняя строка входных
данных содержит одно слово HELP.


Формат вывода:
Для каждого вопроса Беатрисы выведите ответ Августа на этот вопрос. После этого
выведите (через пробел, в порядке возрастания) все числа, которые мог загадать
Август после ответа на все вопросы Беатрисы.


Пример 1:
input:
10
1 2 3 4 5
2 4 6 8 10
HELP
output:
NO
YES
6 8 10

Пример 2:
input:
10
1
2
3
4
5
6
7
8
9
HELP
output:
NO
NO
NO
NO
NO
NO
NO
NO
NO
10

Пример 3:
input:
16
1 2 3 4 5 6 7 8
9 10 11 12
13 14
16
HELP
output:
NO
NO
NO
NO
15
"""
import sys


def main(lines: list[str] | None = None) -> tuple[list[str], list[int]]:

    lines = lines or sys.stdin.read().splitlines()

    n = int(lines[0])
    result = set(range(1, n+1))

    answers = []
    i = 1
    while lines[i] != "HELP":
        question = set(map(int, lines[i].split()))

        result_yes = result & question
        if 2 * len(result_yes) > len(result):
            result = result_yes
            answers.append("YES")
        else:
            result -= question
            answers.append("NO")

        i += 1

    return answers, list(sorted(result))


if __name__ == "__main__":
    answers, result = main()
    print("\n".join(answers))
    print(" ".join(map(str, result)))
