"""
Мультиграф

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Дан неориентированный невзвешенный граф. В графе возможны петли и кратные рёбра.
Постройте такой новый граф без петель и кратных рёбер, что для любых двух вершин
в нём расстояние равно расстоянию в исходном графе. Если вершины не связны,
расстояние между ними бесконечность.


Формат ввода:
На первой строке число вершин n и число рёбер m (1 ≤ n, m ≤ 100_000). Следующие
m строк содержат пары чисел от 1 до n – рёбра графа.


Формат вывода:
Новый граф в таком же формате. Рёбра можно выводить в произвольном формате.


Пример:
input:
3 5
1 1
1 3
2 1
1 2
2 3
output:
3 3
1 2
1 3
2 3
"""
import sys


def main(lines: list[str] | None = None) -> tuple[int, int, set[tuple[int, int]]]:

    lines = lines or sys.stdin.read().splitlines()

    n, m = map(int, lines[0].split())
    graph = set()
    for k in range(m):
        i, j = map(int, lines[1+k].split())
        if i < j:
            graph.add((i, j))
        elif j < i:
            graph.add((j, i))

    return n, len(graph), graph


if __name__ == "__main__":
    n, m, graph = main()
    print(f"{n} {m}")
    print("\n".join(f"{i} {j}" for i, j in graph))
