"""
Жребий Крижановского

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Петя играет с друзьями в игру, которую иногда называют "Жребий Крижановского".
Правила игры следующие: в каждом туре каждый игрок загадывает произвольное
натуральное число. После этого игрок, загадавший минимальное число, которое не
повторяется, выигрывает в этом туре, причём его выигрыш равен этому числу.
Например, если играют 6 человек и были загаданы числа 3, 2, 1, 1, 4 и 2, то
выиграл первый игрок, причём его выигрыш равен 3. Если все загаданные числа
повторяются, то тур считается ничейным и никто баллов не получает.

Общий выигрыш игрока за игру равен сумме баллов за все сыгранные туры.

Петя с друзьями при игре просто называют по очереди загаданные ими числа, а
потом определяют, кто выиграл, и подсчитывают баллы. Однако при таком формате
игры в принципе можно сжульничать, не загадывая число заранее, а, уже зная
числа, названные предыдущими игроками, выбрать себе оптимальное "загаданное"
число. Этим и пользуется Петя. Он называет число последним и старается выбрать
число так, чтобы максимизировать свой выигрыш.

Идёт последний тур игры. Известны очки всех игроков перед этим туром и названные
игроками числа. Выясните, какое число следует назвать Пете, чтобы по результатам
игры у как можно большего числа игроков количество баллов было меньше, чем у
него. Если таких чисел несколько, то Петя хочет назвать минимальное возможное.


Формат ввода:
В первой строке вводится число n - количество игроков (2 <= n <= 100). Вторая
строка содержит n чисел - баллы игроков перед последним туром (неотрицательные
целые числа, не большие 100). Баллы перечислены в том порядке, в котором игроки
обычно называют числа (то есть Петины баллы указаны последними). В третьей
строке задано (n-1) число - числа, названные игроками в последнем туре (числа не
превышают 100), в том порядке, в котором они их называли.


Формат вывода:
Выведите число, которое следует назвать Пете.


Пример 1:
input:
6
0 0 0 0 0 0
2 3 4 5 6
output:
1

Пример 2:
input:
6
8 3 12 5 0 9
2 1 3 1 4
output:
2

Пример 3:
input:
8
0 0 0 0 0 0 0 0
1 1 2 2 3 3 4
output:
1
"""
import sys


def main(lines: list[str] | None = None) -> int:

    lines = lines or sys.stdin.read().splitlines()

    n = int(lines[0])
    scores = list(map(int, lines[1].split()))
    nums = list(map(int, lines[2].split()))

    unique = set()
    not_unique = set()
    for num in nums:
        if num in not_unique:
            continue
        elif num in unique:
            unique.remove(num)
            not_unique.add(num)
        else:
            unique.add(num)

    max_count = -1
    res = -1
    for ans in range(1, 102):
        scores_copy = scores.copy()
        nums_copy = nums.copy()
        unique_copy = unique.copy()
        not_unique_copy = not_unique.copy()

        nums_copy.append(ans)

        if ans in not_unique_copy:
            pass
        elif ans in unique_copy:
            unique_copy.remove(ans)
            not_unique_copy.add(ans)
        else:
            unique_copy.add(ans)

        if unique_copy:
            winner = min(unique_copy)

            for i, num in enumerate(nums_copy):
                if num == winner:
                    scores_copy[i] += winner

        count = 0
        for j in range(n - 1):
            if scores_copy[j] < scores_copy[-1]:
                count += 1

        if count > max_count:
            max_count = count
            res = ans

    return res


if __name__ == "__main__":
    result = main()
    print(result)
