"""
Фибоначчи возвращается

Ограничение времени - 2 секунды
Ограничение памяти - 128Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

Вам даётся последовательность чисел. Для каждого числа определите, является ли
оно числом Фибоначчи. Напомним, что числа Фибоначчи определяются так:
f_0 = f_1 = 1,
f_n = f_{n−1} + f_{n−2}.


Формат ввода:
Первая строка содержит одно число N (1 ≤ N ≤ 10^6) – количество запросов.
Следующие N строк содержат по одному целому числу. При этом соблюдаются
следующие ограничения:
1. Размер каждого числа не превосходит 5000 цифр в десятичном представлении.
2. Размер входа не превышает 1 Мб.


Формат вывода:
Для каждого числа, данного во входном файле, выведите «Yes», если оно является
числом Фибоначчи, и «No» в противном случае.


Пример:
input:
8
1
2
3
4
5
6
7
8
output:
Yes
Yes
Yes
No
Yes
No
No
Yes
"""
import sys


def main(lines: list[str] | None = None) -> None:

    lines = lines or sys.stdin.read().splitlines()

    ...

    return


if __name__ == "__main__":
    result = main()
    print(result)
